benchmark/go-frameworks/results/20260924-102750/results/get/gin/r1/20000.txt
Running 40s test @ http://10.128.0.4:8083/api/devices
  16 threads and 512 connections
  Thread calibration: mean lat.: 0.919ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.918ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.059ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.914ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.910ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.911ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.902ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.915ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.913ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.916ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.909ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.909ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.904ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.027ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.902ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.932ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.92ms  443.09us   9.18ms   68.54%
    Req/Sec     1.33k   530.52     3.56k    89.38%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.91ms
 75.000%    1.20ms
 90.000%    1.47ms
 99.000%    2.02ms
 99.900%    3.39ms
 99.990%    4.81ms
 99.999%    8.61ms
100.000%    9.19ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.098     0.000000            2         1.00
       0.362     0.100000        59914         1.11
       0.519     0.200000       119398         1.25
       0.656     0.300000       179236         1.43
       0.784     0.400000       238964         1.67
       0.906     0.500000       298842         2.00
       0.965     0.550000       328348         2.22
       1.024     0.600000       358124         2.50
       1.083     0.650000       388062         2.86
       1.143     0.700000       417866         3.33
       1.204     0.750000       447639         4.00
       1.237     0.775000       462593         4.44
       1.274     0.800000       477809         5.00
       1.311     0.825000       492459         5.71
       1.353     0.850000       507631         6.67
       1.402     0.875000       522256         8.00
       1.433     0.887500       529720         8.89
       1.467     0.900000       537152        10.00
       1.506     0.912500       544773        11.43
       1.548     0.925000       552187        13.33
       1.595     0.937500       559533        16.00
       1.622     0.943750       563312        17.78
       1.651     0.950000       567027        20.00
       1.684     0.956250       570731        22.86
       1.721     0.962500       574476        26.67
       1.765     0.968750       578254        32.00
       1.788     0.971875       580056        35.56
       1.815     0.975000       581935        40.00
       1.845     0.978125       583819        45.71
       1.879     0.981250       585645        53.33
       1.918     0.984375       587510        64.00
       1.940     0.985938       588430        71.11
       1.966     0.987500       589371        80.00
       1.995     0.989062       590303        91.43
       2.029     0.990625       591237       106.67
       2.075     0.992188       592198       128.00
       2.107     0.992969       592648       142.22
       2.153     0.993750       593105       160.00
       2.235     0.994531       593560       182.86
       2.359     0.995313       594026       213.33
       2.509     0.996094       594492       256.00
       2.585     0.996484       594729       284.44
       2.669     0.996875       594957       320.00
       2.763     0.997266       595193       365.71
       2.865     0.997656       595429       426.67
       2.981     0.998047       595659       512.00
       3.051     0.998242       595775       568.89
       3.129     0.998437       595890       640.00
       3.205     0.998633       596011       731.43
       3.297     0.998828       596124       853.33
       3.403     0.999023       596240      1024.00
       3.451     0.999121       596298      1137.78
       3.521     0.999219       596357      1280.00
       3.589     0.999316       596415      1462.86
       3.657     0.999414       596473      1706.67
       3.757     0.999512       596532      2048.00
       3.805     0.999561       596560      2275.56
       3.881     0.999609       596589      2560.00
       3.941     0.999658       596619      2925.71
       4.087     0.999707       596649      3413.33
       4.171     0.999756       596677      4096.00
       4.223     0.999780       596691      4551.11
       4.311     0.999805       596706      5120.00
       4.395     0.999829       596722      5851.43
       4.519     0.999854       596736      6826.67
       4.603     0.999878       596750      8192.00
       4.747     0.999890       596757      9102.22
       4.891     0.999902       596764     10240.00
       5.287     0.999915       596772     11702.86
       5.647     0.999927       596779     13653.33
       6.871     0.999939       596786     16384.00
       7.135     0.999945       596790     18204.44
       7.439     0.999951       596793     20480.00
       7.611     0.999957       596797     23405.71
       8.011     0.999963       596801     27306.67
       8.223     0.999969       596804     32768.00
       8.239     0.999973       596806     36408.89
       8.295     0.999976       596808     40960.00
       8.319     0.999979       596810     46811.43
       8.527     0.999982       596812     54613.33
       8.559     0.999985       596813     65536.00
       8.575     0.999986       596814     72817.78
       8.591     0.999988       596815     81920.00
       8.607     0.999989       596816     93622.86
       8.663     0.999991       596817    109226.67
       8.815     0.999992       596819    131072.00
       8.815     0.999993       596819    145635.56
       8.815     0.999994       596819    163840.00
       8.815     0.999995       596819    187245.71
       8.863     0.999995       596820    218453.33
       8.863     0.999996       596820    262144.00
       8.863     0.999997       596820    291271.11
       8.895     0.999997       596821    327680.00
       8.895     0.999997       596821    374491.43
       8.895     0.999998       596821    436906.67
       8.895     0.999998       596821    524288.00
       8.895     0.999998       596821    582542.22
       9.191     0.999998       596822    655360.00
       9.191     1.000000       596822          inf
#[Mean    =        0.922, StdDeviation   =        0.443]
#[Max     =        9.184, Total count    =       596822]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  796369 requests in 40.01s, 288.60MB read
Requests/sec:  19903.14
Transfer/sec:      7.21MB